[
  {
    "id": "s8-superchain-eco",
    "name": "Superchain Eco S8",
    "description": "This pilot campaign will test our new campaigns feature and reward the most active Super Users of Season 8 with a share of OP tokens provided by the Superchain Eco team.",
    "start_date": "2025-11-07",
    "end_date": "2025-12-17",
    "network": ["OP Mainnet"],
    "banner": "/images/campaigns/superchain.png",
    "participate_description": "Due to campaign set-up only deposits in your EOA wallets connected to your account will earn rewards. Perks earned by your account (incl multipliers) will be activated on all wallets you have connected.",
    "campaign_link": null,
    "boosts": [],
    "campaign_reward": {
      "symbol": "OP",
      "amount": 13000,
      "token": "0x4200000000000000000000000000000000000042",
      "decimals": 18
    },
    "end_block": 145165412,
    "start_block": 125901059,
    "airdrop_condition_id": 2,
    "max_claim_date": "2026-02-07",
    "more_info": "The Superchain Eco Season 8 Campaign is the first campaign to leverage the new campaign feature and will reward the most active Super Users of Season 8.\n\n**How to participate**  \nAll Season 8 badges included in this campaign allow you to earn Superchain Points that count toward this campaign's leaderboard. Follow the guidelines for each badge to earn them.\n\n**How rewards will be calculated**  \nAt the end of the campaign, a snapshot will be taken of the total Superchain Points per account in this campaign. This snapshot will be used to finalize a calculation that distributes the campaign budget to all participants. In this pilot campaign, only users with over 500 campaign-specific points will be eligible to receive rewards.",
    "campaign_badges": [
      {
        "type": "campaign_badge",
        "id": "5",
        "badgeName": "Citizen",
        "description": "Earned during the campaign."
      },
      {
        "type": "campaign_badge",
        "id": "24",
        "badgeName": "S8 Super User",
        "description": "Transactions made during campaign."
      },
      {
        "type": "campaign_badge",
        "id": "26",
        "badgeName": "ETH Vault Deposits",
        "description": "ETH staked during campaign."
      }
    ]
  }
]
